IDEA Open Model
IdeaRS.OpenModel.CrossSection Namespace
Compatible with IDEA StatiCa Beta 20.0
[Missing <summary> documentation for "N:IdeaRS.OpenModel.CrossSection"]
Classes
Class | Description
CrossSection
 Cross-section
CrossSectionComponent
 Cross-section defined by components
CrossSectionComponentThermalData
 Cross-section component thermal data
CrossSectionCreepCoefficientAttribute
 Cross-section creep coefficient attribute
CrossSectionCreepCoefficientData
 Cross-section component creep coefficient data
CrossSectionFactory
 CrossSectionFactory
CrossSectionGeneralColdFormed
 Creates one item cross-section of general cold formed profile defined by it´s center line
CrossSectionParameter
 Cross-section defined by parameters
CrossSectionThermalAttribute
 Cross-section thermal attribute
CssComponent
 One component of cross-section
Parameter
 Common parameter of cross-section
ParameterBool
 Boolean parameter of cross-section
ParameterDouble
 Double parameter of cross-section
ParameterInt
 Integer parameter of cross-section
ParameterReferenceElement
 Reference element parameter of cross-section
ParameterString
 String parameter of cross-section
ReinforcedBar
 Reinforced bar
ReinforcedCrossSection
 Reinforced cross-section
Stirrup
 Stirrup
TendonBar
 Tendon bar
TendonDuct
 Tendon duct
Enumerations
Enumeration | Description
CrossSectionType
 Type of cross-section
FatigueTypeOfPrestressingSteel
 Posttensioned reinforcement type
InputValueType
 Input value type
MaterialDuct
 Tendon ducts material type
TendonBarType
 Tendon bar type
ThermalConductivityLimit
 Thermal conductivity limit